#include <iostream>

int main()
{
    // 대입 연산자 (=)
    // 연산자 기준 오른쪽 값을 왼쪽 메모리에 대입함


    // 산술 연산자
    // + 연산자
    // - 연산자
    // * 연산자
    // / 연산자
    // // 연산자 (정수 몫만 반환 -> 소수점 밑에는 버림)
    // % 연산자 (나머지만 반환)


    // 부호 연산자
    // +3
    // -3


    // 복합 대입 연산자
    // +=
    // -=
    // *=
    // /=
    // %=


    // 증감 연산자
    // ++ (증가 연산자)
    // -- (감소 연산자)
    // 앞에 붙이면 먼저 실행하고, 뒤에 붙이면 뒤에서 실행
    // (ex - ++a(전위 증가 연산자), a++(후위 증가 연산자))


    // 관계 연산자
    // <, >
    // ==
    // <=, >=


    // 논리 연산자
    // && (and)
    // || (or)
    // ! (not)
    
    
    // 비트 연산자
    // & (비트 and 연산자, 피연산자가 2개, 참조연산자는 피연산자가 하나로 별개이다)
    // 

    // 5 & 10
    // (5)  00000101
    // (10) 00001010

    return 0;
}